In [12]:
import pandas as pd
import numpy as np

In [79]:
#1
df=pd.read_csv("data.csv", encoding='windows-1251')
df

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst
...,...,...,...,...,...,...
995,sql,Программист разработчик эксперт по внедрению ...,51.0,NaN,25.42,Главный специалист Отдела перспективных технол...
996,sql,Программист-разработчик,22.0,NaN,1.58,Full Stack
997,sql,Программист c# .Net Core ASP.Net Core .Net ...,42.0,NaN,9.33,BackEnd Developer .Net C#
998,sql,Python SQL R Data Science Statistics AI Machin...,NaN,NaN,16.08,Study Scientific Leader Data Science and Adva...
999,sql,Junior Data Scientist/Data Analyst/Data Engine...,19.0,NaN,0.33,Technical Support Intern

In [81]:
#2
sdf=df.loc[:, ['job_title', 'age', 'salary', 'exp. period']]
sdf.fillna(value=0,inplace=True)
sdf

        job_title   age    salary  exp. period
0    data analyst  22.0       0.0         2.67
1    data analyst  21.0       0.0         0.83
2    data analyst  30.0       0.0         7.50
3    data analyst  24.0       0.0         4.92
4    data analyst  27.0  450000.0         3.25
..            ...   ...       ...          ...
995           sql  51.0       0.0        25.42
996           sql  22.0       0.0         1.58
997           sql  42.0       0.0         9.33
998           sql   0.0       0.0        16.08
999           sql  19.0       0.0         0.33

[1000 rows x 4 columns]

In [83]:
#3
x=sdf.drop('job_title',axis=1)
x

      age    salary  exp. period
0    22.0       0.0         2.67
1    21.0       0.0         0.83
2    30.0       0.0         7.50
3    24.0       0.0         4.92
4    27.0  450000.0         3.25
..    ...       ...          ...
995  51.0       0.0        25.42
996  22.0       0.0         1.58
997  42.0       0.0         9.33
998   0.0       0.0        16.08
999  19.0       0.0         0.33

[1000 rows x 3 columns]

In [84]:
#4
y=sdf['job_title']
y

0      data analyst
1      data analyst
2      data analyst
3      data analyst
4      data analyst
           ...
995             sql
996             sql
997             sql
998             sql
999             sql
Name: job_title, Length: 1000, dtype: object

In [85]:
#5
from sklearn.model_selection import train_test_split

In [86]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,train_size=0.8,stratify=y)

In [87]:
#6
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [91]:
model.fit(xtrain,ytrain)

GaussianNB()

In [92]:
y_model=model.predict(xtest)

In [94]:
#7
from sklearn.metrics import accuracy_score
accuracy_score(ytest,y_model)

0.315

In [95]:
#8
from sklearn.model_selection import cross_val_score

In [96]:
cross_val_score(model,x,y,cv=10)

array([0.35, 0.33, 0.35, 0.34, 0.35, 0.34, 0.35, 0.34, 0.35, 0.34])

In [100]:
scores=cross_val_score(model,x,y,cv=10)
scores.mean()

0.344

In [101]:
#9
from sklearn.neighbors import KNeighborsClassifier
model=KNeighborsClassifier(n_neighbors=3)

In [106]:
model.fit(x,y)
y_model2=model.predict(x)

In [107]:
#10
accuracy_score(y,y_model2)

0.865

In [108]:
#11
scores2=cross_val_score(model,x,y,cv=10)
scores2.mean()

0.857